
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2023.2.307.2.17
# Date: 2024-02-25 18:57

# Copyright (C) 2013 - 2023 Efinix Inc. All rights reserved.

# Device: T8Q144
# Project: sdram_test
# Timing Model: C4 (final)

# PLL Constraints
#################
create_clock -period 6.0377 sdram_clk
create_clock -period 6.0377 sdram_smpl_clk
create_clock -period 16.6667 ulpiClk
create_clock -period 7.6923 adcClk

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDir}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDir}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiNxt}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiNxt}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[7]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~7~242}] -max 0.610 [get_ports {sdram_A[0]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~7~242}] -min -0.085 [get_ports {sdram_A[0]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~15~242}] -max 0.610 [get_ports {sdram_A[1]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~15~242}] -min -0.085 [get_ports {sdram_A[1]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~12~242}] -max 0.610 [get_ports {sdram_A[2]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~12~242}] -min -0.085 [get_ports {sdram_A[2]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~10~242}] -max 0.610 [get_ports {sdram_A[3]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~10~242}] -min -0.085 [get_ports {sdram_A[3]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~228}] -max 0.610 [get_ports {sdram_A[4]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~228}] -min -0.085 [get_ports {sdram_A[4]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~226}] -max 0.610 [get_ports {sdram_A[5]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~226}] -min -0.085 [get_ports {sdram_A[5]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~211}] -max 0.610 [get_ports {sdram_A[6]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~211}] -min -0.085 [get_ports {sdram_A[6]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~208}] -max 0.610 [get_ports {sdram_A[7]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~208}] -min -0.085 [get_ports {sdram_A[7]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~186}] -max 0.610 [get_ports {sdram_A[8]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~186}] -min -0.085 [get_ports {sdram_A[8]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~183}] -max 0.610 [get_ports {sdram_A[9]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~183}] -min -0.085 [get_ports {sdram_A[9]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~20~242}] -max 0.610 [get_ports {sdram_A[10]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~20~242}] -min -0.085 [get_ports {sdram_A[10]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~161}] -max 0.610 [get_ports {sdram_A[11]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~161}] -min -0.085 [get_ports {sdram_A[11]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~158}] -max 0.610 [get_ports {sdram_A[12]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~158}] -min -0.085 [get_ports {sdram_A[12]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~203}] -max 0.610 [get_ports {sdram_BA[0]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~203}] -min -0.085 [get_ports {sdram_BA[0]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~201}] -max 0.610 [get_ports {sdram_BA[1]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~201}] -min -0.085 [get_ports {sdram_BA[1]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~168}] -max 0.610 [get_ports {sdram_CASb}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~168}] -min -0.085 [get_ports {sdram_CASb}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~146}] -max 0.610 [get_ports {sdram_CKE}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~146}] -min -0.085 [get_ports {sdram_CKE}]
set_output_delay -clock_fall -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~143}] -max 0.610 [get_ports {sdram_clkout_HI}]
set_output_delay -clock_fall -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~143}] -min -0.085 [get_ports {sdram_clkout_HI}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~143}] -max 0.610 [get_ports {sdram_clkout_LO}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~143}] -min -0.085 [get_ports {sdram_clkout_LO}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~183}] -max 0.610 [get_ports {sdram_CSb}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~183}] -min -0.085 [get_ports {sdram_CSb}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~108}] -max 0.610 [get_ports {sdram_DQMH}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~108}] -min -0.085 [get_ports {sdram_DQMH}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~133}] -max 0.610 [get_ports {sdram_DQML}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~133}] -min -0.085 [get_ports {sdram_DQML}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~171}] -max 0.610 [get_ports {sdram_RASb}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~171}] -min -0.085 [get_ports {sdram_RASb}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~138}] -max 0.610 [get_ports {sdram_WEb}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~138}] -min -0.085 [get_ports {sdram_WEb}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiRstb}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiRstb}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~25}] -max 0.858 [get_ports {sdram_DQ_IN[0]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~25}] -min 0.429 [get_ports {sdram_DQ_IN[0]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~26}] -max 0.610 [get_ports {sdram_DQ_OUT[0]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~26}] -min -0.085 [get_ports {sdram_DQ_OUT[0]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~26}] -max 0.603 [get_ports {sdram_DQ_OE[0]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~26}] -min -0.087 [get_ports {sdram_DQ_OE[0]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~65}] -max 0.858 [get_ports {sdram_DQ_IN[1]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~65}] -min 0.429 [get_ports {sdram_DQ_IN[1]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~66}] -max 0.610 [get_ports {sdram_DQ_OUT[1]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~66}] -min -0.085 [get_ports {sdram_DQ_OUT[1]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~66}] -max 0.603 [get_ports {sdram_DQ_OE[1]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~66}] -min -0.087 [get_ports {sdram_DQ_OE[1]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~67}] -max 0.858 [get_ports {sdram_DQ_IN[2]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~67}] -min 0.429 [get_ports {sdram_DQ_IN[2]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~68}] -max 0.610 [get_ports {sdram_DQ_OUT[2]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~68}] -min -0.085 [get_ports {sdram_DQ_OUT[2]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~68}] -max 0.603 [get_ports {sdram_DQ_OE[2]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~68}] -min -0.087 [get_ports {sdram_DQ_OE[2]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~85}] -max 0.858 [get_ports {sdram_DQ_IN[3]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~85}] -min 0.429 [get_ports {sdram_DQ_IN[3]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~86}] -max 0.610 [get_ports {sdram_DQ_OUT[3]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~86}] -min -0.085 [get_ports {sdram_DQ_OUT[3]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~86}] -max 0.603 [get_ports {sdram_DQ_OE[3]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~86}] -min -0.087 [get_ports {sdram_DQ_OE[3]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~87}] -max 0.858 [get_ports {sdram_DQ_IN[4]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~87}] -min 0.429 [get_ports {sdram_DQ_IN[4]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~88}] -max 0.610 [get_ports {sdram_DQ_OUT[4]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~88}] -min -0.085 [get_ports {sdram_DQ_OUT[4]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~88}] -max 0.603 [get_ports {sdram_DQ_OE[4]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~88}] -min -0.087 [get_ports {sdram_DQ_OE[4]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~90}] -max 0.858 [get_ports {sdram_DQ_IN[5]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~90}] -min 0.429 [get_ports {sdram_DQ_IN[5]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~91}] -max 0.610 [get_ports {sdram_DQ_OUT[5]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~91}] -min -0.085 [get_ports {sdram_DQ_OUT[5]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~91}] -max 0.603 [get_ports {sdram_DQ_OE[5]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~91}] -min -0.087 [get_ports {sdram_DQ_OE[5]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~95}] -max 0.858 [get_ports {sdram_DQ_IN[6]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~95}] -min 0.429 [get_ports {sdram_DQ_IN[6]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~96}] -max 0.610 [get_ports {sdram_DQ_OUT[6]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~96}] -min -0.085 [get_ports {sdram_DQ_OUT[6]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~96}] -max 0.603 [get_ports {sdram_DQ_OE[6]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~96}] -min -0.087 [get_ports {sdram_DQ_OE[6]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~97}] -max 0.858 [get_ports {sdram_DQ_IN[7]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~1~97}] -min 0.429 [get_ports {sdram_DQ_IN[7]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~98}] -max 0.610 [get_ports {sdram_DQ_OUT[7]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~98}] -min -0.085 [get_ports {sdram_DQ_OUT[7]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~98}] -max 0.603 [get_ports {sdram_DQ_OE[7]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~1~98}] -min -0.087 [get_ports {sdram_DQ_OE[7]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~105}] -max 0.858 [get_ports {sdram_DQ_IN[8]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~105}] -min 0.429 [get_ports {sdram_DQ_IN[8]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~106}] -max 0.610 [get_ports {sdram_DQ_OUT[8]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~106}] -min -0.085 [get_ports {sdram_DQ_OUT[8]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~106}] -max 0.603 [get_ports {sdram_DQ_OE[8]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~106}] -min -0.087 [get_ports {sdram_DQ_OE[8]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~92}] -max 0.858 [get_ports {sdram_DQ_IN[9]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~92}] -min 0.429 [get_ports {sdram_DQ_IN[9]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~93}] -max 0.610 [get_ports {sdram_DQ_OUT[9]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~93}] -min -0.085 [get_ports {sdram_DQ_OUT[9]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~93}] -max 0.603 [get_ports {sdram_DQ_OE[9]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~93}] -min -0.087 [get_ports {sdram_DQ_OE[9]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~90}] -max 0.858 [get_ports {sdram_DQ_IN[10]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~90}] -min 0.429 [get_ports {sdram_DQ_IN[10]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~91}] -max 0.610 [get_ports {sdram_DQ_OUT[10]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~91}] -min -0.085 [get_ports {sdram_DQ_OUT[10]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~91}] -max 0.603 [get_ports {sdram_DQ_OE[10]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~91}] -min -0.087 [get_ports {sdram_DQ_OE[10]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~82}] -max 0.858 [get_ports {sdram_DQ_IN[11]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~82}] -min 0.429 [get_ports {sdram_DQ_IN[11]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~83}] -max 0.610 [get_ports {sdram_DQ_OUT[11]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~83}] -min -0.085 [get_ports {sdram_DQ_OUT[11]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~83}] -max 0.603 [get_ports {sdram_DQ_OE[11]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~83}] -min -0.087 [get_ports {sdram_DQ_OE[11]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~80}] -max 0.858 [get_ports {sdram_DQ_IN[12]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~80}] -min 0.429 [get_ports {sdram_DQ_IN[12]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~81}] -max 0.610 [get_ports {sdram_DQ_OUT[12]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~81}] -min -0.085 [get_ports {sdram_DQ_OUT[12]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~81}] -max 0.603 [get_ports {sdram_DQ_OE[12]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~81}] -min -0.087 [get_ports {sdram_DQ_OE[12]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~65}] -max 0.858 [get_ports {sdram_DQ_IN[13]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~65}] -min 0.429 [get_ports {sdram_DQ_IN[13]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~66}] -max 0.610 [get_ports {sdram_DQ_OUT[13]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~66}] -min -0.085 [get_ports {sdram_DQ_OUT[13]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~66}] -max 0.603 [get_ports {sdram_DQ_OE[13]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~66}] -min -0.087 [get_ports {sdram_DQ_OE[13]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~17}] -max 0.858 [get_ports {sdram_DQ_IN[14]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~17}] -min 0.429 [get_ports {sdram_DQ_IN[14]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~18}] -max 0.610 [get_ports {sdram_DQ_OUT[14]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~18}] -min -0.085 [get_ports {sdram_DQ_OUT[14]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~18}] -max 0.603 [get_ports {sdram_DQ_OE[14]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~18}] -min -0.087 [get_ports {sdram_DQ_OE[14]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~15}] -max 0.858 [get_ports {sdram_DQ_IN[15]}]
set_input_delay -clock sdram_smpl_clk -reference_pin [get_ports {sdram_smpl_clk~CLKOUT~159~15}] -min 0.429 [get_ports {sdram_DQ_IN[15]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~16}] -max 0.610 [get_ports {sdram_DQ_OUT[15]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~16}] -min -0.085 [get_ports {sdram_DQ_OUT[15]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~16}] -max 0.603 [get_ports {sdram_DQ_OE[15]}]
set_output_delay -clock sdram_clk -reference_pin [get_ports {sdram_clk~CLKOUT~159~16}] -min -0.087 [get_ports {sdram_DQ_OE[15]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_IN[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_IN[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OUT[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OUT[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OE[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OE[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_IN[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_IN[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OUT[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OUT[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OE[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OE[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_IN[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_IN[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OUT[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OUT[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OE[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OE[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_IN[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_IN[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OUT[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OUT[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OE[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OE[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_IN[4]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_IN[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OUT[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OUT[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OE[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OE[4]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_IN[5]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_IN[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OUT[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OUT[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OE[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OE[5]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_IN[6]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_IN[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OUT[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OUT[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OE[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OE[6]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_IN[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_IN[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OUT[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OUT[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiDat_OE[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiDat_OE[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiStp_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiStp_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiStp_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiStp_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ulpiStp_OE}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ulpiStp_OE}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 1.396> [get_ports {sdram_clk}]
# set_clock_latency -source -hold <board_min + 0.698> [get_ports {sdram_clk}]
# set_clock_latency -source -setup <board_max + 1.396> [get_ports {sdram_smpl_clk}]
# set_clock_latency -source -hold <board_min + 0.698> [get_ports {sdram_smpl_clk}]
# set_clock_latency -source -setup <board_max -2.314> [get_ports {ulpiClk}]
# set_clock_latency -source -hold <board_min -1.157> [get_ports {ulpiClk}]
# set_clock_latency -source -setup <board_max -2.314> [get_ports {adcClk}]
# set_clock_latency -source -hold <board_min -1.157> [get_ports {adcClk}]
