#create_clock -name sdram_clk -period 6.000  [get_ports sdram_clk]
#create_clock -name ulpiClk   -period 16.667 [get_ports ulpiClk]
set_clock_groups -asynchronous -group [get_clocks sdram_clk] -group [get_clocks ulpiClk] -group [get_clocks adcClk]

# generated ULPI IO constraints:
set_clock_latency -source -setup -2.314 [get_ports {ulpiClk}]
set_clock_latency -source -hold  -1.157 [get_ports {ulpiClk}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.146 [get_ports {ulpiDir}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.398 [get_ports {ulpiDir}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.146 [get_ports {ulpiNxt}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.398 [get_ports {ulpiNxt}]
set_output_delay -clock [get_clocks ulpiClk] -max 10.329 [get_ports {ulpiRstb}]
set_output_delay -clock [get_clocks ulpiClk] -min  2.115 [get_ports {ulpiRstb}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.146 [get_ports {ulpiDat_IN[0]}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.398 [get_ports {ulpiDat_IN[0]}]
set_output_delay -clock [get_clocks ulpiClk] -max 10.011 [get_ports {ulpiDat_OUT[0]}]
set_output_delay -clock [get_clocks ulpiClk] -min  1.956 [get_ports {ulpiDat_OUT[0]}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.146 [get_ports {ulpiDat_IN[1]}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.398 [get_ports {ulpiDat_IN[1]}]
set_output_delay -clock [get_clocks ulpiClk] -max 10.011 [get_ports {ulpiDat_OUT[1]}]
set_output_delay -clock [get_clocks ulpiClk] -min  1.956 [get_ports {ulpiDat_OUT[1]}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.146 [get_ports {ulpiDat_IN[2]}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.398 [get_ports {ulpiDat_IN[2]}]
set_output_delay -clock [get_clocks ulpiClk] -max 10.011 [get_ports {ulpiDat_OUT[2]}]
set_output_delay -clock [get_clocks ulpiClk] -min  1.956 [get_ports {ulpiDat_OUT[2]}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.146 [get_ports {ulpiDat_IN[3]}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.398 [get_ports {ulpiDat_IN[3]}]
set_output_delay -clock [get_clocks ulpiClk] -max 10.011 [get_ports {ulpiDat_OUT[3]}]
set_output_delay -clock [get_clocks ulpiClk] -min  1.956 [get_ports {ulpiDat_OUT[3]}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.146 [get_ports {ulpiDat_IN[4]}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.398 [get_ports {ulpiDat_IN[4]}]
set_output_delay -clock [get_clocks ulpiClk] -max 10.011 [get_ports {ulpiDat_OUT[4]}]
set_output_delay -clock [get_clocks ulpiClk] -min  1.956 [get_ports {ulpiDat_OUT[4]}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.046 [get_ports {ulpiDat_IN[5]}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.348 [get_ports {ulpiDat_IN[5]}]
set_output_delay -clock [get_clocks ulpiClk] -max  9.911 [get_ports {ulpiDat_OUT[5]}]
set_output_delay -clock [get_clocks ulpiClk] -min  1.905 [get_ports {ulpiDat_OUT[5]}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.046 [get_ports {ulpiDat_IN[6]}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.348 [get_ports {ulpiDat_IN[6]}]
set_output_delay -clock [get_clocks ulpiClk] -max  9.911 [get_ports {ulpiDat_OUT[6]}]
set_output_delay -clock [get_clocks ulpiClk] -min  1.905 [get_ports {ulpiDat_OUT[6]}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.046 [get_ports {ulpiDat_IN[7]}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.348 [get_ports {ulpiDat_IN[7]}]
set_output_delay -clock [get_clocks ulpiClk] -max  9.911 [get_ports {ulpiDat_OUT[7]}]
set_output_delay -clock [get_clocks ulpiClk] -min  1.905 [get_ports {ulpiDat_OUT[7]}]
set_input_delay -clock [get_clocks ulpiClk] -max  8.146 [get_ports {ulpiStp_IN}]
set_input_delay -clock [get_clocks ulpiClk] -min  2.398 [get_ports {ulpiStp_IN}]
set_output_delay -clock [get_clocks ulpiClk] -max 10.011 [get_ports {ulpiStp_OUT}]
set_output_delay -clock [get_clocks ulpiClk] -min  1.956 [get_ports {ulpiStp_OUT}]
